Revit 2024 API
LoadCase Class
 An object that represents a load usage.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class LoadCase : Element
Visual Basic
Public Class LoadCase _
	Inherits Element
Visual C++
public ref class LoadCase : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadCase
See Also
LoadCase Members
Autodesk.Revit.DB.Structure Namespace